> ```
> provider "rancher2" {
>  api_url   = "https://<rancher ip>"
>  token_key = "<rancher token>"
>  insecure  = true
>}
> resource "rancher2_cloud_credential" "zzz" {
>  name = "openstack_credential_config"
>  openstack_credential_config {
>    password = "zzz"
>  }
>}
>```

Using this tf file with rancher2 provider, cloud_credential seems created fine on rancher 2.3.x and 2.4.x versions. If you are using this provider as part of tf modules, please take a look to your tf modules config.

```
terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rancher2_cloud_credential.zzz will be created
  + resource "rancher2_cloud_credential" "zzz" {
      + annotations = (known after apply)
      + driver      = (known after apply)
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = "openstack_credential_config"

      + openstack_credential_config {
          + password = (sensitive value)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_cloud_credential.zzz: Creating...
rancher2_cloud_credential.zzz: Creation complete after 2s [id=cattle-global-data:cc-47wqc]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
rawmind:terraform-provider-rancher2 rsanchez$ terraform apply
rancher2_cloud_credential.zzz: Refreshing state... [id=cattle-global-data:cc-47wqc]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
``` 